## Plan Result (prod-backendappgateway)




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
  * module.backendappgateway.azurerm_public_ip.app_gw[0]
  * module.backendappgateway.azurerm_public_ip.app_gw[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
        name                              = "cft-aks00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (7 unchanged attributes hidden)

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/dg-docmosis-redirect" -> null
          - http_listener_name          = "dg-docmosis-redirect" -> null
          - id                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/dg-docmosis-redirect" -> null
          - name                        = "dg-docmosis-redirect" -> null
          - priority                    = 850 -> null
          - redirect_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/redirectConfigurations/dg-docmosis-redirect" -> null
          - redirect_configuration_name = "dg-docmosis-redirect" -> null
          - rule_type                   = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - backend_address_pool_name  = "aac-manage-case-assignment" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/aac-manage-case-assignment" -> null
          - backend_http_settings_name = "aac-manage-case-assignment" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/aac-manage-case-assignment" -> null
          - http_listener_name         = "aac-manage-case-assignment" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/aac-manage-case-assignment" -> null
          - name                       = "aac-manage-case-assignment" -> null
          - priority                   = 690 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/adoption-cos-api" -> null
          - backend_address_pool_name  = "adoption-cos-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - backend_http_settings_name = "adoption-cos-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/adoption-cos-api" -> null
          - http_listener_name         = "adoption-cos-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/adoption-cos-api" -> null
          - name                       = "adoption-cos-api" -> null
          - priority                   = 250 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - backend_address_pool_name  = "am-org-role-mapping-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/am-org-role-mapping-service" -> null
          - backend_http_settings_name = "am-org-role-mapping-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-org-role-mapping-service" -> null
          - http_listener_name         = "am-org-role-mapping-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/am-org-role-mapping-service" -> null
          - name                       = "am-org-role-mapping-service" -> null
          - priority                   = 630 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/am-role-assignment-service" -> null
          - backend_address_pool_name  = "am-role-assignment-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/am-role-assignment-service" -> null
          - backend_http_settings_name = "am-role-assignment-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-role-assignment-service" -> null
          - http_listener_name         = "am-role-assignment-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/am-role-assignment-service" -> null
          - name                       = "am-role-assignment-service" -> null
          - priority                   = 150 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bar-api" -> null
          - backend_address_pool_name  = "bar-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bar-api" -> null
          - backend_http_settings_name = "bar-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bar-api" -> null
          - http_listener_name         = "bar-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/bar-api" -> null
          - name                       = "bar-api" -> null
          - priority                   = 550 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - backend_address_pool_name  = "bulk-scan-orchestrator" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-orchestrator" -> null
          - backend_http_settings_name = "bulk-scan-orchestrator" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-orchestrator" -> null
          - http_listener_name         = "bulk-scan-orchestrator" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/bulk-scan-orchestrator" -> null
          - name                       = "bulk-scan-orchestrator" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - backend_address_pool_name  = "bulk-scan-payment-processor" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-payment-processor" -> null
          - backend_http_settings_name = "bulk-scan-payment-processor" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-payment-processor" -> null
          - http_listener_name         = "bulk-scan-payment-processor" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/bulk-scan-payment-processor" -> null
          - name                       = "bulk-scan-payment-processor" -> null
          - priority                   = 620 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/bulk-scan-processor" -> null
          - backend_address_pool_name  = "bulk-scan-processor" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-processor" -> null
          - backend_http_settings_name = "bulk-scan-processor" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-processor" -> null
          - http_listener_name         = "bulk-scan-processor" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/bulk-scan-processor" -> null
          - name                       = "bulk-scan-processor" -> null
          - priority                   = 200 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-api" -> null
          - backend_address_pool_name  = "camunda-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/camunda-api" -> null
          - backend_http_settings_name = "camunda-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/camunda-api" -> null
          - http_listener_name         = "camunda-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/camunda-api" -> null
          - name                       = "camunda-api" -> null
          - priority                   = 700 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-bpm" -> null
          - backend_address_pool_name  = "camunda-bpm" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/camunda-bpm" -> null
          - backend_http_settings_name = "camunda-bpm" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/camunda-bpm" -> null
          - http_listener_name         = "camunda-bpm" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/camunda-bpm" -> null
          - name                       = "camunda-bpm" -> null
          - priority                   = 1000 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/camunda-optimize" -> null
          - backend_address_pool_name  = "camunda-optimize" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/camunda-optimize" -> null
          - backend_http_settings_name = "camunda-optimize" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/camunda-optimize" -> null
          - http_listener_name         = "camunda-optimize" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/camunda-optimize" -> null
          - name                       = "camunda-optimize" -> null
          - priority                   = 770 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-admin-web" -> null
          - backend_address_pool_name  = "ccd-admin-web" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-admin-web" -> null
          - backend_http_settings_name = "ccd-admin-web" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/ccd-admin-web" -> null
          - http_listener_name         = "ccd-admin-web" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/requestRoutingRules/ccd-admin-web" -> null
          - name                       = "ccd-admin-web" -> null
          - priority                   = 420 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-case-activity-api" -> null
          - backend_address_pool_name  = "ccd-case-activity-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739d

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ttp_settings_name = "et-sya-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-sya-api" -> null
          - http_listener_name         = "et-sya-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-sya-api" -> null
          - name                       = "et-sya-api" -> null
          - priority                   = 90 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ia-bail-case-api" -> null
          - backend_address_pool_name  = "ia-bail-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - backend_http_settings_name = "ia-bail-case-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ia-bail-case-api" -> null
          - http_listener_name         = "ia-bail-case-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ia-bail-case-api" -> null
          - name                       = "ia-bail-case-api" -> null
          - priority                   = 30 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend" -> null
          - backend_address_pool_name  = "plum-recipe-backend" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - backend_http_settings_name = "plum-recipe-backend" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/plum-recipe-backend" -> null
          - http_listener_name         = "plum-recipe-backend" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/plum-recipe-backend" -> null
          - name                       = "plum-recipe-backend" -> null
          - priority                   = 70 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sptribs-case-api" -> null
          - backend_address_pool_name  = "sptribs-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sptribs-case-api" -> null
          - backend_http_settings_name = "sptribs-case-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sptribs-case-api" -> null
          - http_listener_name         = "sptribs-case-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sptribs-case-api" -> null
          - name                       = "sptribs-case-api" -> null
          - priority                   = 60 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - priority                   = 80 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - priority                   = 40 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = (known after apply)
          + name                       = "am-judicial-booking-service"
          + priority                   = 80
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-cos"
          + id                         = (known after apply)
          + name                       = "et-cos"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-msg-handler"
          + id                         = (known after apply)
          + name                       = "et-msg-handler"
          + priority                   = 30
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya-api"
          + id                         = (known after apply)
          + name                       = "et-sya-api"
          + priority                   = 40
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-bail-case-api"
          + id                         = (known after apply)
          + name                       = "ia-bail-case-api"
          + priority                   = 70
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum-recipe-backend"
          + id                         = (known after apply)
          + name                       = "plum-recipe-backend"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-case-api"
          + id                         = (known after apply)
          + name                       = "sptribs-case-api"
          + priority                   = 90
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (37 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip"
        name                    = "cft-aks-appgw-prod-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (10 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip-1"
        name                    = "cft-aks-appgw-prod-pip-1"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.backendappgateway.azurerm_application_gateway.ag[0] has changed
  ~ resource "azurerm_application_gateway" "ag" {
      + fips_enabled                      = false
      + force_firewall_policy_association = false
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
        name                              = "cft-aks00-prod-agw"
      + private_endpoint_connection       = []
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp"
            name                          = "appGwPublicFrontendIp"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_ip_configuration {
            id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
            name                          = "appGwPrivateFrontendIp"
            # (3 unchanged attributes hidden)
        }

      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "aac-manage-case-assignment-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/aac-manage-case-assignment"
          + name                           = "aac-manage-case-assignment"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "aac-manage-case-assignment-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/aac-manage-case-assignment" -> null
          - name                           = "aac-manage-case-assignment" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "adoption-cos-api-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/adoption-cos-api"
          + name                           = "adoption-cos-api"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "adoption-cos-api-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/adoption-cos-api" -> null
          - name                           = "adoption-cos-api" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "am-org-role-mapping-service-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-org-role-mapping-service"
          + name                           = "am-org-role-mapping-service"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "am-org-role-mapping-service-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-org-role-mapping-service" -> null
          - name                           = "am-org-role-mapping-service" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "am-role-assignment-service-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-role-assignment-service"
          + name                           = "am-role-assignment-service"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "am-role-assignment-service-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/am-role-assignment-service" -> null
          - name                           = "am-role-assignment-service" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bar-api-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bar-api"
          + name                           = "bar-api"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bar-api-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bar-api" -> null
          - name                           = "bar-api" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-orchestrator-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-orchestrator"
          + name                           = "bulk-scan-orchestrator"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bulk-scan-orchestrator-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-orchestrator" -> null
          - name                           = "bulk-scan-orchestrator" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-payment-processor-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-payment-processor"
          + name                           = "bulk-scan-payment-processor"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bulk-scan-payment-processor-prod.service.core-compute-prod.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/httpListeners/bulk-scan-payment-processor" -> null
          - name                           = "bulk-scan-payment-processor" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-processor-prod.service.core-compute-prod.internal"
          + host_names                     = []
          + id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicatio

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler"
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-msg-handler"
          + http_listener_name         = "et-msg-handler"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-msg-handler"
          + name                       = "et-msg-handler"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-msg-handler" -> null
          - backend_address_pool_name  = "et-msg-handler" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler" -> null
          - backend_http_settings_name = "et-msg-handler" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-msg-handler" -> null
          - http_listener_name         = "et-msg-handler" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-msg-handler" -> null
          - name                       = "et-msg-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-sya-api"
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-sya-api"
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-sya-api"
          + http_listener_name         = "et-sya-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-sya-api"
          + name                       = "et-sya-api"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-sya-api" -> null
          - backend_address_pool_name  = "et-sya-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - backend_http_settings_name = "et-sya-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-sya-api" -> null
          - http_listener_name         = "et-sya-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-sya-api" -> null
          - name                       = "et-sya-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ia-bail-case-api"
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api"
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ia-bail-case-api"
          + http_listener_name         = "ia-bail-case-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ia-bail-case-api"
          + name                       = "ia-bail-case-api"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ia-bail-case-api" -> null
          - backend_address_pool_name  = "ia-bail-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - backend_http_settings_name = "ia-bail-case-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ia-bail-case-api" -> null
          - http_listener_name         = "ia-bail-case-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ia-bail-case-api" -> null
          - name                       = "ia-bail-case-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend"
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend"
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + priority                   = 70
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend" -> null
          - backend_address_pool_name  = "plum-recipe-backend" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend" -> null
          - backend_http_settings_name = "plum-recipe-backend" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/plum-recipe-backend" -> null
          - http_listener_name         = "plum-recipe-backend" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/plum-recipe-backend" -> null
          - name                       = "plum-recipe-backend" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sptribs-case-api"
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sptribs-case-api"
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sptribs-case-api"
          + http_listener_name         = "sptribs-case-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sptribs-case-api"
          + name                       = "sptribs-case-api"
          + priority                   = 60
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sptribs-case-api" -> null
          - backend_address_pool_name  = "sptribs-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sptribs-case-api" -> null
          - backend_http_settings_name = "sptribs-case-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sptribs-case-api" -> null
          - http_listener_name         = "sptribs-case-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sptribs-case-api" -> null
          - name                       = "sptribs-case-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + priority                   = 80
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - rule_type                  = "Basic" -> null
        }

        # (35 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] has changed
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip"
        name                    = "cft-aks-appgw-prod-pip"
      + sku_tier                = "Regional"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ zones                   = [
          + "1",
          + "2",
          + "3",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] has changed
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip-1"
        name                    = "cft-aks-appgw-prod-pip-1"
      + sku_tier                = "Regional"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ zones                   = [
          + "1",
          + "2",
          + "3",
        ]
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1369,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->